app/Controllers/Auth.php

SELECT *
FROM `barang`
---
    public function login()
    {
        // Jika user sudah login, jangan kasih halaman landing, langsung lempar ke dashboard
        if (session()->get('logged_in')) {
            return redirect()->to('/dashboard');
        }

        $barangModel = new BarangModel();

        $data = [
            'title'  => 'Ventura - Sewa Alat Outdoor',
            'barang' => $barangModel->findAll() // Mengambil semua data barang untuk ditampilkan
        ];