app/Controllers/Barang.php

    public function index()
    {
        // Mengambil semua data barang dari database
        $data = [
            'title'  => 'Daftar Alat Kamping',
            'barang' => $this->barangModel->findAll()
---
SELECT *
FROM `barang`

    public function store()
    {
        // 1. Ambil file foto dari form (Multiple)
        $files = $this->request->getFileMultiple('foto_barang');

        $listNamaFoto = [];
        foreach ($files as $file) {
            // Cek apakah ada file yang diunggah dan valid
            if ($file->isValid() && !$file->hasMoved()) {
                $newName = $file->getRandomName(); // Generate nama unik
                $file->move('uploads/barang', $newName); // Pindahkan ke folder uploads
                $listNamaFoto[] = $newName;
            }
        }

        // 2. Jika tidak ada foto sama sekali, pakai default
        $stringFoto = empty($listNamaFoto) ? 'tenda.jpg' : implode(',', $listNamaFoto);

        // 3. Simpan data ke database
        $this->barangModel->save([
            'nama_barang' => $this->request->getPost('nama_barang'),
            'stok'        => $this->request->getPost('stok'),
            'harga_sewa'  => $this->request->getPost('harga_sewa'),
            'kondisi'     => $this->request->getPost('kondisi'),
            'foto_barang' => $stringFoto
        ]);
---
INSERT INTO `barang` (`nama_barang`, `stok`, `harga_sewa`, `kondisi`, `foto_barang`, `created_at`, `updated_at`) VALUES ('kantong', '1', '100', 'Bagus', '1775443030_996cbe0347000ab34764.jpg', '2026-04-06 02:37:10', '2026-04-06 02:37:10')

    public function update($id)
    {
        // 1. Ambil data barang lama
        $barangLama = $this->barangModel->find($id);

        // 2. Ambil list foto lama dari database
        $fotoLama = ($barangLama['foto_barang'] == 'tenda.jpg') ? [] : explode(',', $barangLama['foto_barang']);

        // 3. Ambil file baru dari form (jika ada)
        $files = $this->request->getFileMultiple('foto_barang');

        $fotoBaruDiunggah = [];
        if ($files) {
            foreach ($files as $file) {
                if ($file->isValid() && !$file->hasMoved()) {
                    $newName = $file->getRandomName();
                    $file->move('uploads/barang', $newName);
                    $fotoBaruDiunggah[] = $newName;
                }
            }
        }

        // 4. Gabungkan list lama dengan yang baru diupload
        $arrayFotoFinal = array_merge($fotoLama, $fotoBaruDiunggah);
        $stringFotoFinal = empty($arrayFotoFinal) ? 'tenda.jpg' : implode(',', $arrayFotoFinal);

        // 5. Update database
        $this->barangModel->update($id, [
            'nama_barang' => $this->request->getPost('nama_barang'),
            'stok'        => $this->request->getPost('stok'),
            'harga_sewa'  => $this->request->getPost('harga_sewa'),
            'kondisi'     => $this->request->getPost('kondisi'),
            'foto_barang' => $stringFotoFinal
        ]);
---
UPDATE `barang` SET `nama_barang` = 'Tenda Dome Arpenaz 4P', `stok` = '1', `harga_sewa` = '1000', `kondisi` = 'Rusak Berat', `foto_barang` = '1775452249_a008052d042603a90eda.png', `updated_at` = '2026-04-06 05:10:49'
WHERE `barang`.`id_barang` IN ('1')

    public function hapusFotoSatuan()
    {
        $namaFile = $this->request->getPost('nama_file');
        $idBarang = $this->request->getPost('id_barang');

        $barang = $this->barangModel->find($idBarang);
        if (!$barang) return $this->response->setJSON(['status' => 'error', 'msg' => 'Data hilang']);

        $fotos = explode(',', $barang['foto_barang']);

        // Cari file di array, hapus dari daftar, lalu hapus fisiknya
        if (($key = array_search($namaFile, $fotos)) !== false) {
            unset($fotos[$key]);

            if ($namaFile != 'tenda.jpg' && file_exists('uploads/barang/' . $namaFile)) {
                unlink('uploads/barang/' . $namaFile);
            }

            $stringBaru = empty($fotos) ? 'tenda.jpg' : implode(',', $fotos);
            $this->barangModel->update($idBarang, ['foto_barang' => $stringBaru]);
---
SELECT *
FROM `barang`
WHERE `barang`.`id_barang` = '1'
UPDATE `barang` SET `foto_barang` = '1775452264_01f6639c1e01b4e24fc7.png', `updated_at` = '2026-04-06 05:11:14'
WHERE `barang`.`id_barang` IN ('1')