app/Controllers/Barang.php

SELECT `kategori`
FROM `barang`
WHERE `kategori` != ''
GROUP BY `kategori`
SELECT *
FROM `barang`
ORDER BY `views` DESC
---
    public function index()
    {
        $db = \Config\Database::connect();

        // Mengambil daftar kategori unik (tidak duplikat) untuk mengisi pilihan di filter dropdown
        $listKategori = $db->table('barang')
            ->select('kategori')
            ->where('kategori !=', '')
            ->groupBy('kategori')
            ->get()
            ->getResultArray();

        // Menangkap data pencarian/filter
        $kategoriSelected = $this->request->getVar('kategori'); // Dari dropdown halaman barang
        $keywordDashboard = $this->request->getVar('cari');     // Dari kolom pencarian dashboard

        // Logika Filter: Jika ada kategori yang dipilih atau kata kunci yang dicari, filter data modelnya
        if ($kategoriSelected !== null && $kategoriSelected !== '') {
            $this->barangModel->where('kategori', $kategoriSelected);
        } elseif ($keywordDashboard !== null && $keywordDashboard !== '') {
            $this->barangModel->like('kategori', $keywordDashboard);
            $kategoriSelected = $keywordDashboard;
        }

        $data = [
            'title'         => 'Daftar Alat Kamping',
            'listKategori'  => $listKategori,
            'kategoriAktif' => $kategoriSelected,
            // Ambil data barang, urutkan dari yang paling banyak dilihat (populer)
            'barang'        => $this->barangModel->orderBy('views', 'DESC')->findAll()

UPDATE `barang` SET `nama_barang` = 'Tenda Dome Arpenaz 4P', `stok` = '1', `harga_sewa` = '1000', `kondisi` = 'Rusak Ringan', `foto_barang` = '1775442859_2b47fecd7349d6d38241.jpg', `updated_at` = '2026-04-06 02:36:26'
WHERE `barang`.`id_barang` IN ('1')
SELECT *
FROM `barang`
WHERE `barang`.`id_barang` = '1'
---
    public function detail($id)
    {
        $barang = $this->barangModel->find($id);

        if (!$barang) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        // Views Counter: Jika user bukan admin, maka jumlah dilihat (views) bertambah +1
        if (strtolower(session()->get('role')) !== 'admin') {
            $this->barangModel->where('id_barang', $id)
                ->set('views', 'views + 1', FALSE)
                ->update();