app/Controllers/BaseController.php

SELECT `transaksi`.*, `users`.`nama` as `nama_user`
FROM `transaksi`
JOIN `users` ON `users`.`id_user` = `transaksi`.`id_user`
WHERE `is_read` = 0
ORDER BY `transaksi`.`created_at` DESC
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
WHERE `id_user` = '4'
AND `denda` > 0
AND `status_denda` = 0
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        parent::initController($request, $response, $logger);

        $this->session = \Config\Services::session();
        $this->db      = \Config\Database::connect();

        $id_user = $this->session->get('id_user');
        $role    = $this->session->get('role');

        $notif_count = 0;
        $notif_list  = [];
        // Variabel khusus chat
        $chat_unread = 0;

        // --- 1. NOTIFIKASI TRANSAKSI (Lonceng Atas) ---
        if ($role == 'admin' || $role == 'Admin') {
            $builder = $this->db->table('transaksi');
            $builder->select('transaksi.*, users.nama as nama_user');
            $builder->join('users', 'users.id_user = transaksi.id_user');
            $builder->where('is_read', 0);
            $builder->orderBy('transaksi.created_at', 'DESC');

            $notif_list  = $builder->get()->getResultArray();
            $notif_count = count($notif_list);
        } elseif ($id_user) {
            $notif_count = $this->db->table('transaksi')
                ->where('id_user', $id_user)
                ->where('denda >', 0)
                ->where('status_denda', 0)
                ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `pesan`
WHERE `id_penerima` = '2'
AND `id_pengirim` != '2'
AND `status_baca` = '0'
---
        // --- 2. NOTIFIKASI CHAT (Ikon Biru Kanan Bawah) ---
        // Kita hitung pesan yang id_penerimanya SAYA dan id_pengirimnya BUKAN SAYA
        if ($id_user) {
            $chat_unread = $this->db->table('pesan')
                ->where('id_penerima', $id_user)
                ->where('id_pengirim !=', $id_user)
                ->where('status_baca', '0')
                ->countAllResults();

SELECT `transaksi`.*, `users`.`username` as `nama_user`, `barang`.`nama_barang`
FROM `transaksi`
JOIN `users` ON `users`.`id_user` = `transaksi`.`id_user`
JOIN `barang` ON `barang`.`id_barang` = `transaksi`.`id_barang`
WHERE `transaksi`.`status_transaksi` = 'Dipinjam'
AND `transaksi`.`tgl_kembali` < '2026-04-24'
---
        if ($role == 'admin' || $role == 'Admin') {
            $today = date('Y-m-d');
            $list_terlambat = $this->db->table('transaksi')
                // Kita ambil users.username dan berikan alias 'nama_user'
                ->select('transaksi.*, users.username as nama_user, barang.nama_barang')
                ->join('users', 'users.id_user = transaksi.id_user')
                ->join('barang', 'barang.id_barang = transaksi.id_barang')
                ->where('transaksi.status_transaksi', 'Dipinjam')
                ->where('transaksi.tgl_kembali <', $today)
                ->get()->getResultArray();