app/Controllers/Pesan.php

SELECT COUNT(*) AS `numrows`
FROM `pesan`
WHERE `status_baca` = '0'
AND   (
`id_penerima` = 0
OR `id_penerima` = '2'
 )
---
    public function countUnread()
    {
        $id_saya = session()->get('id_user');

        // Logika notifikasi: Jika admin, cek pesan yang ke ID 0 atau ID dia sendiri
        $query = $this->pesanModel->where('status_baca', '0');
        if (session()->get('role') == 'admin') {
            $query->groupStart()
                ->where('id_penerima', 0)
                ->orWhere('id_penerima', $id_saya)
                ->groupEnd();
        } else {
            $query->where('id_penerima', $id_saya);
        }

        $count = $query->countAllResults();