app/Controllers/Transaksi.php

    public function index()
    {
        $id_user = session()->get('id_user');
        if (!$id_user) return redirect()->to('/login');

        $keyword = $this->request->getVar('cari');
        $tgl_filter = $this->request->getVar('tgl');

        $query = $this->transaksiModel->select('transaksi.*, barang.nama_barang')
            ->join('barang', 'barang.id_barang = transaksi.id_barang')
            ->where('id_user', $id_user);

        if ($tgl_filter) {
            $query->where('transaksi.tgl_pinjam', $tgl_filter);
        }

        if ($keyword) {
            $query->groupStart()
                ->like('barang.nama_barang', $keyword)
                ->orLike('transaksi.id_transaksi', $keyword)
                ->groupEnd();
        }

        $data = [
            'title'     => 'Riwayat Pinjam - Ventura',
            'transaksi' => $query->orderBy('transaksi.created_at', 'DESC')->findAll(),
            'cari'      => $keyword,
            'tgl'       => $tgl_filter
        ];
---
SELECT `transaksi`.*, `barang`.`nama_barang`
FROM `transaksi`
JOIN `barang` ON `barang`.`id_barang` = `transaksi`.`id_barang`
WHERE `id_user` = '11'
ORDER BY `transaksi`.`created_at` DESC

    public function kelola()
    {
        // --- LOGIKA DENDA OTOMATIS START ---
        $tgl_sekarang = time();
        $tarif_denda = 10000; // Sesuaikan tarif per hari

        // Ambil transaksi yang sedang dipinjam dan belum lunas dendanya
        $cek_telat = $this->transaksiModel->where('status_transaksi', 'Dipinjam')
            ->where('status_denda', 0)
            ->findAll();
---
SELECT *
FROM `transaksi`
WHERE `status_transaksi` = 'Dipinjam'
AND `status_denda` = 0