app/Controllers/Transaksi.php

        $tgl_filter = $this->request->getVar('tgl');

        // Query untuk admin menampilkan data lengkap user dan barang
        $query = $this->transaksiModel->select('transaksi.*, barang.nama_barang, users.nama as nama_user, users.no_wa')
            ->join('barang', 'barang.id_barang = transaksi.id_barang')
            ->join('users', 'users.id_user = transaksi.id_user');
---
SELECT `transaksi`.*, `barang`.`nama_barang`, `users`.`nama` as `nama_user`, `users`.`no_wa`
FROM `transaksi`
JOIN `barang` ON `barang`.`id_barang` = `transaksi`.`id_barang`
JOIN `users` ON `users`.`id_user` = `transaksi`.`id_user`
ORDER BY `transaksi`.`created_at` DESC