app/Models/GunungModel.php

    public function getAll()
    {
        return $this->findAll();
---
SELECT *
FROM `gunung`